do
function run(msg, matches)
  return [[
  🔹اوامر ادارة المجموعات 🔹
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹معلوماتي : معلومات العضو | 📃
🔹معلومات المجموعة : معلومات الكروب | 💢
🔹الاعدادات : الاعدادات | ⚙
🔹موقعي : موقعك في المجموعة | 🏌
🔹الاعضاء : قائمة الاعضاء | 👥
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹رفع ادمن : رفع ادمن | ➕
🔹تنزيل ادمن : تنزيل ادمن | ✖️
🔹الادمنيه : قائمة الادمنية | 👥
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹الرابط : رابط الكروب | 🔗
🔹وضع رابط : وضع رابط | 📌
🔹رابط جديد : : رابط جديد | 🆕
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹منع + كلمة : لمنع كلمة معينةة | ✖️
🔹الغاء منع + كلمة :  بالسماح بالكلمة |✔️
🔹قائمة المنع  : قائمة الكلمات | 💭
🔹حذف قائمة المنع  : مسح الكلمات |🔰
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹ضع قوانين  + وضع قوانين : القوانين | ⚙
🔹القوانين  : رؤية القوانين | 👁
🔹ضع وصف  + وضع وصف : الوصف | 🔧
🔹ضع اسم  + وضع اسم : اسم | 🎫
🔹ضع صورة  : وضع صوره | 🎡
🔹ضع ترحيب + الترحيب : لوضع الترحيب |🚏
🔹ضع توديع + التوديع : لوضع التوديع | 💭
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹حذف  ↴ حذف ⛔️
🔹الادمنية : الادمنية | 👥
🔹الوصف : الوصف | 📃
🔹المكتومين : المكتومين | 🗣
🔹القوانين :  القوانين | 🎌
🔹الترحيب : رسالة الترحيب | 📝
🔹التوديع : رسالة الخروج | 🖐
🔹➖🔸➖🔹➖🔸➖🔹➖🔸
🔹channel : @llYAll
   ]]
end
return {
  patterns = {
    "^h1"
  }, 
  run = run 
}
end